data/Parm_PH_29/alpha_15/alpha_15_7929_4048/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0348279109254663 1.00195549917933 -2.59095232924867e-18)
(0.104483732776399 1.00195549917933 2.49457880269694e-18)
(0.17413968907306 1.00154525709452 9.63401330111219e-20)
(0.243763044217246 0.99948594261652 2.6854279933314e-18)
(0.313240756270474 0.994614921084097 -9.6111605372365e-20)
(0.382360607149361 0.986147985577794 -2.68381185656268e-18)
(0.450777325896757 0.973256335198312 -2.59440954724168e-18)
(0.518072066106625 0.95543596717284 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0348314189324666 1 0)
(0.1044942567974 1 0)
(0.174152695832637 0.999589007234918 0)
(0.243769347825687 0.997526464458386 0)
(0.313236521568074 0.992648319239577 0)
(0.382340528120842 0.984170206067871 0)
(0.450736544757755 0.971263123592508 0)
(0.518008079788288 0.953422249155513 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0330375 4.048 0)
(0.0991125 4.048 0)
(0.1651875 4.048 0)
(0.2312625 4.048 0)
(0.2973375 4.048 0)
(0.3634125 4.048 0)
(0.4294875 4.048 0)
(0.4955625 4.048 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
