data/Parm_PH_29/alpha_15/alpha_15_7929_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00473657 -0.00007045 0.00000000 0.00001958 0.00000000 0.00274238)
(0.00514278 -0.00008218 0.00000000 0.00002343 0.00000000 0.00290162)
(0.00512993 -0.00008488 0.00000000 0.00002326 0.00000000 0.00277938)
(0.00342784 -0.00004468 0.00000000 0.00000761 0.00000000 0.00171404)
(0.00091143 -0.00000828 0.00000000 -0.00001008 0.00000000 0.00021131)
(0.00043401 -0.00001725 0.00000000 -0.00000491 0.00000000 0.00019262)
(0.00029551 0.00001832 0.00000000 -0.00001160 0.00000000 0.00071461)
(0.00032273 -0.00004068 0.00000000 0.00000166 0.00000000 0.00052855)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
